#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Reading...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=3404aa547881f97317129b17cb69145b8163b35bb5724b79ecdb3a8995194c10]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2888806183]
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_network_security_group.nsg-router will be created
  + resource "azurerm_network_security_group" "nsg-router" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg-router"
      + resource_group_name = "rg-net-hub-001"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "93.219.76.209/32"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
    }

  # azurerm_resource_group.rg_compute will be created
  + resource "azurerm_resource_group" "rg_compute" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-compute-001"
      + tags     = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # azurerm_resource_group.rg_hub will be created
  + resource "azurerm_resource_group" "rg_hub" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-net-hub-001"
      + tags     = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # azurerm_subnet.subnet_hub[0] will be created
  + resource "azurerm_subnet" "subnet_hub" {
      + address_prefixes                               = [
          + "10.0.0.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "RouterSubnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-net-hub-001"
      + virtual_network_name                           = "vnet_hub-001"
    }

  # azurerm_virtual_network.vnet_hub will be created
  + resource "azurerm_virtual_network" "vnet_hub" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "vnet_hub-001"
      + resource_group_name = "rg-net-hub-001"
      + subnet              = (known after apply)
      + tags                = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.spoke1network.azurerm_resource_group.rg-spoke will be created
  + resource "azurerm_resource_group" "rg-spoke" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-spoke1-001"
      + tags     = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.spoke1network.azurerm_route.default-route will be created
  + resource "azurerm_route" "default-route" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "default-route-entry"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-spoke1-001"
      + route_table_name       = "rt-vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_route_table.spoke-rt-table will be created
  + resource "azurerm_route_table" "spoke-rt-table" {
      + disable_bgp_route_propagation = true
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "rt-vnet-spoke1-001"
      + resource_group_name           = "rg-spoke1-001"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.spoke1network.azurerm_subnet.subnet-spoke[0] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                               = [
          + "10.100.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "WebTier"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-spoke1-001"
      + virtual_network_name                           = "vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_subnet.subnet-spoke[1] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                               = [
          + "10.100.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "LogicTier"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-spoke1-001"
      + virtual_network_name                           = "vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_subnet.subnet-spoke[2] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                               = [
          + "10.100.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "DatabaseTier"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-spoke1-001"
      + virtual_network_name                           = "vnet-spoke1-001"
    }

  # module.spoke1network.azurerm_subnet_route_table_association.route_table_association[0] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke1network.azurerm_subnet_route_table_association.route_table_association[1] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke1network.azurerm_subnet_route_table_association.route_table_association[2] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke1network.azurerm_virtual_network.vnet-spoke will be created
  + resource "azurerm_virtual_network" "vnet-spoke" {
      + address_space       = [
          + "10.100.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "vnet-spoke1-001"
      + resource_group_name = "rg-spoke1-001"
      + subnet              = (known after apply)
      + tags                = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.spoke1network.azurerm_virtual_network_peering.hubspoke will be created
  + resource "azurerm_virtual_network_peering" "hubspoke" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-vnet-spoke1-001"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rg-net-hub-001"
      + use_remote_gateways          = false
      + virtual_network_name         = "vnet_hub-001"
    }

  # module.spoke1network.azurerm_virtual_network_peering.spokehub will be created
  + resource "azurerm_virtual_network_peering" "spokehub" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "vnet-spoke1-001-hub"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rg-spoke1-001"
      + use_remote_gateways          = true
      + virtual_network_name         = "vnet-spoke1-001"
    }

  # module.spoke2network.azurerm_resource_group.rg-spoke will be created
  + resource "azurerm_resource_group" "rg-spoke" {
      + id       = (known after apply)
      + location = "swedencentral"
      + name     = "rg-spoke2-001"
      + tags     = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.spoke2network.azurerm_route.default-route will be created
  + resource "azurerm_route" "default-route" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "default-route-entry"
      + next_hop_in_ip_address = (known after apply)
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "rg-spoke2-001"
      + route_table_name       = "rt-vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_route_table.spoke-rt-table will be created
  + resource "azurerm_route_table" "spoke-rt-table" {
      + disable_bgp_route_propagation = true
      + id                            = (known after apply)
      + location                      = "swedencentral"
      + name                          = "rt-vnet-spoke2-001"
      + resource_group_name           = "rg-spoke2-001"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.spoke2network.azurerm_subnet.subnet-spoke[0] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                               = [
          + "10.101.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "WebTier"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-spoke2-001"
      + virtual_network_name                           = "vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_subnet.subnet-spoke[1] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                               = [
          + "10.101.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "LogicTier"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-spoke2-001"
      + virtual_network_name                           = "vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_subnet.subnet-spoke[2] will be created
  + resource "azurerm_subnet" "subnet-spoke" {
      + address_prefixes                               = [
          + "10.101.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "DatabaseTier"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-spoke2-001"
      + virtual_network_name                           = "vnet-spoke2-001"
    }

  # module.spoke2network.azurerm_subnet_route_table_association.route_table_association[0] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke2network.azurerm_subnet_route_table_association.route_table_association[1] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke2network.azurerm_subnet_route_table_association.route_table_association[2] will be created
  + resource "azurerm_subnet_route_table_association" "route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.spoke2network.azurerm_virtual_network.vnet-spoke will be created
  + resource "azurerm_virtual_network" "vnet-spoke" {
      + address_space       = [
          + "10.101.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "vnet-spoke2-001"
      + resource_group_name = "rg-spoke2-001"
      + subnet              = (known after apply)
      + tags                = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.spoke2network.azurerm_virtual_network_peering.hubspoke will be created
  + resource "azurerm_virtual_network_peering" "hubspoke" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "hub-vnet-spoke2-001"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rg-net-hub-001"
      + use_remote_gateways          = false
      + virtual_network_name         = "vnet_hub-001"
    }

  # module.spoke2network.azurerm_virtual_network_peering.spokehub will be created
  + resource "azurerm_virtual_network_peering" "spokehub" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "vnet-spoke2-001-hub"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rg-spoke2-001"
      + use_remote_gateways          = true
      + virtual_network_name         = "vnet-spoke2-001"
    }

  # module.ubunturoutervm.azurerm_network_interface.spokevmnic will be created
  + resource "azurerm_network_interface" "spokevmnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "swedencentral"
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-compute-001"
      + tags                          = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "vm-hub-dev-001-ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic will be created
  + resource "azurerm_public_ip" "pip_spokevmnic" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "swedencentral"
      + name                    = "pip-vm-hub-dev-001"
      + resource_group_name     = "rg-compute-001"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
    }

  # module.ubunturoutervm.azurerm_storage_account.spokestorageaccount will be created
  + resource "azurerm_storage_account" "spokestorageaccount" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-compute-001"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
              + "Logging",
              + "Metrics",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "20.52.95.48",
              + "51.116.75.88",
              + "51.12.22.174",
              + "51.12.72.223",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.ubunturoutervm.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-hub-dev-001"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + vm_size                          = "Standard_B1s"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-hub-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.ubunturoutervm.random_id.randomId will be created
  + resource "random_id" "randomId" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "rg-compute-001"
        }
    }

  # module.ubunturoutervm.random_id.randomIdVM will be created
  + resource "random_id" "randomIdVM" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ubunturoutervm.random_id.randomid_pip will be created
  + resource "random_id" "randomid_pip" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ubuntuspoke1.azurerm_network_interface.spokevmnic will be created
  + resource "azurerm_network_interface" "spokevmnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "swedencentral"
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-compute-001"
      + tags                          = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "vm-spoke1-dev-001-ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.ubuntuspoke1.azurerm_storage_account.spokestorageaccount will be created
  + resource "azurerm_storage_account" "spokestorageaccount" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-compute-001"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
              + "Logging",
              + "Metrics",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "20.52.95.48",
              + "51.116.75.88",
              + "51.12.22.174",
              + "51.12.72.223",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.ubuntuspoke1.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-spoke1-dev-001"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + vm_size                          = "Standard_B1ls2"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-spoke1-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.ubuntuspoke1.random_id.randomId will be created
  + resource "random_id" "randomId" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "rg-compute-001"
        }
    }

  # module.ubuntuspoke1.random_id.randomIdVM will be created
  + resource "random_id" "randomIdVM" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.ubuntuspoke2.azurerm_network_interface.spokevmnic will be created
  + resource "azurerm_network_interface" "spokevmnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "swedencentral"
      + mac_address                   = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg-compute-001"
      + tags                          = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "vm-spoke2-dev-001-ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.ubuntuspoke2.azurerm_storage_account.spokestorageaccount will be created
  + resource "azurerm_storage_account" "spokestorageaccount" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "swedencentral"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-compute-001"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }

      + network_rules {
          + bypass                     = [
              + "AzureServices",
              + "Logging",
              + "Metrics",
            ]
          + default_action             = "Deny"
          + ip_rules                   = [
              + "20.52.95.48",
              + "51.116.75.88",
              + "51.12.22.174",
              + "51.12.72.223",
            ]
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.ubuntuspoke2.azurerm_virtual_machine.spokevm will be created
  + resource "azurerm_virtual_machine" "spokevm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "swedencentral"
      + name                             = "vm-spoke2-dev-001"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "rg-compute-001"
      + tags                             = {
          + "applicationname" = "SpokeVendingMachine"
          + "environment"     = "Dev"
          + "supportgroup"    = "Markus Kraus"
        }
      + vm_size                          = "Standard_B1ls2"

      + boot_diagnostics {
          + enabled     = true
          + storage_uri = (known after apply)
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_image_reference {
            id        = null
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "canonical"
          + sku       = "22_04-lts-gen2"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "vm-spoke2-dev-001-myOsDisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.ubuntuspoke2.random_id.randomId will be created
  + resource "random_id" "randomId" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "resource_group" = "rg-compute-001"
        }
    }

  # module.ubuntuspoke2.random_id.randomIdVM will be created
  + resource "random_id" "randomIdVM" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 46 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + router_public_dns_fqdn = (known after apply)
  + router_public_ip       = (known after apply)
  + router_vm_private_ip   = (known after apply)
  + spoke1_vm_private_ip   = (known after apply)
  + spoke2_vm_private_ip   = (known after apply)
  + vm_username            = "azureuser"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Validate and Plan on PR`*